In [6]:
import pandas as pd
!pip install xlrd
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\users\astor\appdata\roaming\python\python311\site-packages (2.0.1)
Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
     ---- ---------------------------------- 30.7/250.0 kB 1.3 MB/s eta 0:00:01
     ----------------- -------------------- 112.6/250.0 kB 1.3 MB/s eta 0:00:01
     ----------------- ------------------ 122.9/250.0 kB 798.9 kB/s eta 0:00:01
     ------------------------------- ------ 204.8/250.0 kB 1.0 MB/s eta 0:00:01
     -------------------------------------- 250.0/250.0 kB 1.1 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Using cached et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2

In [8]:
dados_pessoas = pd.read_excel('dados.xlsx', sheet_name='pessoas')
dados_notas = pd.read_excel('dados.xlsx', sheet_name='notas')

In [9]:
dados_pessoas

      nome  idade
0   rafael     12
1     joao     32
2    maria     34
3  matheus     23
4    lucas     14

In [10]:
dados_notas

      nome  semestre  nota
0   rafael         1     7
1     joao         1     4
2    maria         1     3
3  matheus         1     7
4    lucas         1     8
5   rafael         2     7
6     joao         2     5
7    maria         2     2
8  matheus         2     7
9    lucas         2     3

In [11]:
dados_todos = dados_notas.set_index('nome').join(dados_pessoas.set_index('nome'))

In [12]:
dados_todos

         semestre  nota  idade
nome
joao            1     4     32
joao            2     5     32
lucas           1     8     14
lucas           2     3     14
maria           1     3     34
maria           2     2     34
matheus         1     7     23
matheus         2     7     23
rafael          1     7     12
rafael          2     7     12

In [15]:
medias = dados_todos.groupby('nome').nota.mean()

In [16]:
medias

nome
joao       4.5
lucas      5.5
maria      2.5
matheus    7.0
rafael     7.0
Name: nota, dtype: float64

In [17]:
maxi = dados_todos.groupby('nome').nota.max()
maxi

nome
joao       5
lucas      8
maria      3
matheus    7
rafael     7
Name: nota, dtype: int64

In [18]:
medias.to_excel('saida.xlsx')